1K_sym/constant/fluid/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water air);

pMin            pMin [ 1 -1 -2 0 0 0 0 ] 10000;

sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.054;//0.0089004;

TMin           TMin [ 0 0 0 1 0 0 0 ] 50;
TMax           TMax [ 0 0 0 1 0 0 0 ] 500;

water
{
    type pureMovingPhaseModel;
}

air
{
    type pureMovingPhaseModel;
}

surfaceForces
{
// 100 times lower
  sigma 0.054; // sigma 0.00059;
  surfaceTensionForceModel gradAlpha;
  accelerationModel gravity;
  deltaFunctionModel alphaCSF;
}

// ************************************************************************* //
