1K_sym/system/fluid/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/fluid";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue p_rgh 101325
    volScalarFieldValue p 101325
    volScalarFieldValue T.water 374.15
    volScalarFieldValue T.air 373.15
);

regions
(
    sphereToCell
    {
        centre (0 50e-6 0);
        radius 5e-6;
        fieldValues
        (
            volScalarFieldValue p_rgh 122925
            volScalarFieldValue p 122925
            volScalarFieldValue T.air 373.15
            volScalarFieldValue T.water 373.15
        );
    }
);


// ************************************************************************* //
