1K_sym/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    c0;
        type    cellSet;
        action  new;
        source  sphereToCell;
        origin      (0 0 0);
        radius      0.05e-3;

    }

    {
        name    solid;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set c0; 
        }
    }

    {
        name    c1;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-1e-3 -1e-3 -1e-3) (0.5e-3 0.5e-3 0.5e-3); 
        }
    }

    {
        name    c1;
        type    cellSet;
        action  subtract;
        source  sphereToCell;
        origin      (0 0 0);
        radius      0.05e-3;
    }

    {
        name    fluid;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set c1; 
        }
    }
);

// ************************************************************************* //
